Farid Masjedi/week04/Movies_app/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find params[:id]

INSERT INTO "movies" ("title", "year", "director", "imdb", "image") VALUES (?, ?, ?, ?, ?)  [["title", "ss"], ["year", ""], ["director", ""], ["imdb", ""], ["image", ""]]
---
  def create
    movie = Movie.create movie_params

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "imdb" = ?, "image" = ? WHERE "movies"."id" = ?
---
  def update
    movie = Movie.find params[:id]
    movie.update movie_params

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]
---
  def destroy
    movie = Movie.find params[:id]
    movie.destroy