Stacey Brosnan/week05/irish_singers/app/controllers/albums_controller.rb

  def show
    @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    album = Album.create album_params
---
INSERT INTO "albums" ("name", "year", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    album = Album.find params[:id]
    album.update album_params
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "albums" SET "name" = ?, "singer_id" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["name", "White Lies"], ["singer_id", 2], ["updated_at", "2020-10-15 07:06:01.894533"], ["id", 2]]

  def destroy
    album = Album.find params[:id]
    album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 4]]