Stacey Brosnan/week05/irish_singers/app/controllers/singers_controller.rb

SELECT "singers".* FROM "singers"
---
  def index
    @singers = Singer.all

SELECT  "singers".* FROM "singers" WHERE "singers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @singer = Singer.find params[:id]

INSERT INTO "singers" ("name", "nationality", "gender", "image") VALUES (?, ?, ?, ?)
---
  def create
    singer = Singer.create singer_params

SELECT  "singers".* FROM "singers" WHERE "singers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @singer = Singer.find params[:id]

SELECT  "singers".* FROM "singers" WHERE "singers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "singers" SET "image" = ? WHERE "singers"."id" = ?  [["image", "https://www.mayonews.ie/images/stories/2019/11_nov_19/1911_Mick-Flannery-in-Concert.jpg"], ["id", 2]]
---
  def update
    singer = Singer.find params[:id]
    singer.update singer_params

SELECT  "singers".* FROM "singers" WHERE "singers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "singers" WHERE "singers"."id" = ?  [["id", 7]]
---
  def destroy
    singer = Singer.find params[:id]
    singer.destroy