Nicholas Mather/week05/oceans_app/app/controllers/oceans_controller.rb

  def index
    @oceans = Ocean.all
---
SELECT "oceans".* FROM "oceans"

  def show
    @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    ocean = Ocean.create :name => params[:name], :image => params[:image], :deepest_point => params[:deepest_point], :area => params[:area], :borders => params[:borders]
---
INSERT INTO "oceans" ("name", "image", "deepest_point", "area", "borders") VALUES (?, ?, ?, ?, ?)

  def edit
    @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    ocean = Ocean.find params[:id]
    ocean.name = params[:name]
    ocean.image = params[:image]
    ocean.deepest_point = params[:deepest_point]
    ocean.area = params[:area]
    ocean.borders = params[:borders]
    ocean.save
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "oceans" SET "image" = ?, "borders" = ? WHERE "oceans"."id" = ?  [["image", ""], ["borders", "Australia Indonesia Swaziland"], ["id", 3]]

  def destroy
    ocean = Ocean.find params[:id]
    ocean.destroy
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "oceans" WHERE "oceans"."id" = ?  [["id", 4]]