Stacey Brosnan/week05/irish_singers/app/views/albums/_form.html.erb

SELECT "singers"."name", "singers"."id" FROM "singers"
---
  <%= f.label :singer_id %>
  <%= f.select :singer_id, Singer.pluck(:name, :id), :include_blank => true %>