Stacey Brosnan/week05/irish_singers/app/views/albums/show.html.erb

    <li>Name: <%= link_to @album.name, @album %></li>
    <% if @album.singer.present? %>
---
SELECT  "singers".* FROM "singers" WHERE "singers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]