Ryan Bullough/week05/Tuesday/mountains_app/app/controllers/mountains_controller.rb

  def create
    mountain = Mountain.create :name => params[:name],:elevation => params[:elevation], :location => params[:location], :first_ascent => params[:first_ascent], :image => params[:image]
---
INSERT INTO "mountains" ("name", "elevation", "location", "first_ascent", "image") VALUES (?, ?, ?, ?, ?)  [["name", "Yellow Admiral"], ["elevation", 12314], ["location", "Australia"], ["first_ascent", "NEVER"], ["image", ""]]