Farid Masjedi/week04/Movies_associations/app/controllers/directors_controller.rb

  def index
    @directors = Director.all
---
SELECT "directors".* FROM "directors"

  def show
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    director = Director.create director_params
---
INSERT INTO "directors" ("name", "nationality", "image") VALUES (?, ?, ?)  [["name", ""], ["nationality", ""], ["image", ""]]

  def edit
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    director = Director.find params[:id]
    director.update director_params
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "directors" SET "nationality" = ?, "image" = ? WHERE "directors"."id" = ?  [["nationality", "Finnish"], ["image", "https://m.media-amazon.com/images/M/MV5BOWFmZjljNDktMWVkNi00ODJiLWE5NmItNjljYzU5ZDRlZTAzXkEyXkFqcGdeQXVyNTI5NjIyMw@@._V1_.jpg"], ["id", 9]]

  def destroy
    director = Director.find params[:id]
    director.destroy
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 19]]