Farid Masjedi/week04/Movies_associations/app/controllers/movies_controller.rb

  def show
    @movie = Movie.find params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    movie = Movie.create movie_params
---
INSERT INTO "movies" ("title", "year", "director", "imdb", "image") VALUES (?, ?, ?, ?, ?)  [["title", "ss"], ["year", ""], ["director", ""], ["imdb", ""], ["image", ""]]

  def update
    movie = Movie.find params[:id]
    movie.update movie_params
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "image" = ? WHERE "movies"."id" = ?  [["image", "https://m.media-amazon.com/images/M/MV5BMjg5MjQ3NjQ5OV5BMl5BanBnXkFtZTYwNDkxNjk5._V1_.jpg"], ["id", 32]]

  def destroy
    movie = Movie.find params[:id]
    movie.destroy
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]