Farid Masjedi/week04/Country_app/app/controllers/pages_controller.rb

  def home
    @countries = Country.all
---
SELECT "countries".* FROM "countries"

  def country
    @country = Country.find params[:id]
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def create
    country = Country.create :name => params[:name],
                             :flag => params[:flag],
                             :continent => params[:continent],
                             :area => params[:area],
                             :population => params[:population],
                             :gdp => params[:gdp],
                             :hdi => params[:hdi]
---
INSERT INTO "countries" ("name", "flag", "continent", "area", "population", "gdp", "hdi") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "United States of America"], ["flag", ""], ["continent", "North America"], ["area", 9833520], ["population", 328239523], ["gdp", 22321.0], ["hdi", 0.92]]

  def edit
    @country = Country.find params[:id]
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    country = Country.find params[:id]

    country.name = params[:name]
    country.flag = params[:flag]
    country.continent = params[:continent]
    country.area = params[:area]
    country.population = params[:population]
    country.gdp = params[:gdp]
    country.hdi = params[:hdi]
    country.save
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "countries" SET "gdp" = ? WHERE "countries"."id" = ?  [["gdp", 458.0], ["id", 1]]

  def delete
    country = Country.find params[:id]
    country.destroy
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 2]]