Giti Mafakheri/week-5/musicianAlbum/app/controllers/musicians_controller.rb

def index
  @musicians = Musician.all
---
SELECT "musicians".* FROM "musicians"

def show
  @musician = Musician.find params[:id]
---
SELECT  "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def create
musician = Musician.create musician_params
---
INSERT INTO "musicians" ("name", "nationality", "dob", "period", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

def edit
  @musician = Musician.find params[:id]
---
SELECT  "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

def destroy
  musician = Musician.find params[:id]
  musician.destroy
---
SELECT  "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "musicians" WHERE "musicians"."id" = ?  [["id", 4]]

def update
  musician = Musician.find params[:id]
  musician.update musician_params
---
SELECT  "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "musicians" SET "dob" = ?, "updated_at" = ? WHERE "musicians"."id" = ?  [["dob", "1915-11-22"], ["updated_at", "2020-10-14 20:35:40.988287"], ["id", 3]]