Giti Mafakheri/week-5/musicianAlbum/app/controllers/works_controller.rb

  def show
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]

  def create
    work = Work.create work_params
---
INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at", "musician_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]

  def update
    work = Work.find params[:id]
    work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "works" SET "year" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["year", "dd"], ["updated_at", "2020-10-15 00:14:16.613900"], ["id", 29]]