Guillaume Canneton/week05/tuesday/six_strings/app/controllers/guitars_controller.rb

  def index
    @guitars = Guitar.all
---
SELECT "guitars".* FROM "guitars"

  def show
    @guitar = Guitar.find params[:id]
---
SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    guitar = Guitar.create :brand => params[:brand], :model => params[:model], :year => params[:year], :image => params[:image], :body => params[:body], :pickups => params[:pickups]
---
INSERT INTO "guitars" ("brand", "model", "image", "body", "pickups") VALUES (?, ?, ?, ?, ?)  [["brand", "Fender"], ["model", "Telecaster"], ["image", "https://www.fmicassets.com/Damroot/ZoomJpg/10001/0146230721_gtr_frt_001_rr.jpg"], ["body", ""], ["pickups", ""]]

  def edit
    @guitar = Guitar.find params[:id]
---
SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    guitar = Guitar.find params[:id]
    guitar.brand = params[:brand]
    guitar.model = params[:model]
    guitar.year = params[:year]
    guitar.image = params[:image]
    guitar.body = params[:body]
    guitar.pickups = params[:pickups]
    guitar.save
---
SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "guitars" SET "image" = ? WHERE "guitars"."id" = ?  [["image", "https://www.fmicassets.com/Damroot/JacksonVert/10001/2803060803_gtr_frt_001_rr.png"], ["id", 3]]

  def destroy
    guitar = Guitar.find params[:id]
    guitar.destroy
---
SELECT  "guitars".* FROM "guitars" WHERE "guitars"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "guitars" WHERE "guitars"."id" = ?  [["id", 9]]