Stacey Brosnan/week05/irish_singers/app/views/singers/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."singer_id" = ?  [["singer_id", 1]]
---

  <% @singer.albums.each do |album| %>