Ryan Bullough/week05/Wednesday/band_app/app/controllers/albums_controller.rb

def show
  @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def edit
  @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]