Ryan Bullough/week05/Wednesday/band_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
def show
  @band = Band.find params[:id]

INSERT INTO "bands" ("name", "formed", "member_count", "genre", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
def create
  band = Band.create band_params

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "bands" SET "member_count" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["member_count", 32], ["updated_at", "2020-10-14 09:18:36.343643"], ["id", 14]]
---
def update
  band = Band.find params[:id]
  band.update band_params

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
def edit
  @band = Band.find params[:id]

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = ?  [["id", 13]]
---
def destroy
  band = Band.find params[:id]
  band.destroy