Guillaume Canneton/week05/wednesday/rail_movie_db/app/controllers/actors_controller.rb

SELECT "actors".* FROM "actors"
---
  def index
    @actors = Actor.all

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @actor = Actor.find params[:id]

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @actor = Actor.find params[:id]