Guillaume Canneton/week05/wednesday/rail_movie_db/app/controllers/directors_controller.rb

  def index
    @directors = Director.all
---
SELECT "directors".* FROM "directors"

  def show
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]