Guillaume Canneton/week05/wednesday/rail_movie_db/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "director", "release", "awards", "length", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    movie = Movie.create movie_params

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find params[:id]

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 6]]
---
  def destroy
    movie = Movie.find params[:id]
    movie.destroy