Hugo Cullinan/week05/films/app/controllers/films_controller.rb

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @film = Film.find params[:id]

INSERT INTO "films" ("name", "image", "director") VALUES (?, ?, ?)  [["name", "Earth"], ["image", ""], ["director", ""]]
---
  def create
    film = Film.create :name => params[:name], :image => params[:image], :director => params[:director], :year => params[:year], :budget => params[:budget], :gross => params[:gross]

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @film = Film.find params[:id]

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "films" SET "name" = ?, "image" = ?, "director" = ?, "budget" = ?, "gross" = ? WHERE "films"."id" = ?  [["name", "King"], ["image", "https://static.techspot.com/images2/news/bigimage/2019/11/2019-11-21-image-6-p_1100.webp"], ["director", ""], ["budget", 112341234.0], ["gross", 12341234.0], ["id", 4]]
---
  def update
    film = Film.find params[:id]
    film.name = params[:name]
    film.image = params[:image]
    film.director = params[:director]
    film.year = params[:year]
    film.budget = params[:budget]
    film.gross = params[:gross]
    film.save

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 4]]
---
  def destroy
    film = Film.find params[:id]
    film.destroy