Stacey Brosnan/week05/mountain-app/app/controllers/mountains_controller.rb

INSERT INTO "mountains" ("name", "image") VALUES (?, ?)  [["name", "earth2"], ["image", "http://www.sheep101.info/Images/Breeds/badgerewe.jpg"]]
---
  def create
    mountain = Mountain.create :name => params[:name], :image => params[:image], :countries => params[:countries], :height => params[:height]

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mountains" SET "countries" = ?, "height" = ? WHERE "mountains"."id" = ?  [["countries", "Australia"], ["height", 2228], ["id", 1]]
---
  def update
    mountain = Mountain.find params[:id]
    mountain.name = params[:name]
    mountain.image = params[:image]
    mountain.countries = params[:countries]
    mountain.height = params[:height]
    mountain.save

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = ?  [["id", 6]]
---
  def delete
    mountain = Mountain.find params[:id]
    mountain.destroy