Farid Masjedi/week04/Movies_associations/app/views/movies/_form.html.erb

SELECT "directors"."name", "directors"."id" FROM "directors"
---
    <p><%= f.text_field :year, :placeholder =>'1991' %></p>
    <p><%= f.select :director_id, Director.pluck(:name, :id),:include_blank => true ,:placeholder =>'Lars Von Trier' %></p>