Farid Masjedi/week04/Movies_associations/app/views/movies/show.html.erb

    <p>Year:<%= " #{@movie.year}" %></p>
    <% if @movie.director.present? %>
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]