Sarah Hong/Homework/Week-05/Tuesday/trek_app/app/controllers/courses_controller.rb

  def show
    @course = Course.find params[:id]
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def create
    course = Course.create :name => params[:name], :location => params[:location], :distance => params[:distance], :image => params[:image], :difficulty => params[:difficulty], :days => params[:days]
---
INSERT INTO "courses" ("name", "location", "distance", "image", "difficulty", "days") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @course = Course.find params[:id] # get course id to edit
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def update
    course = Course.find params[:id] # get the course ID
    course.name = params[:name]
    course.location = params[:location]
    course.distance = params[:distance]
    course.image = params[:image]
    course.difficulty = params[:difficulty]
    course.days = params[:days]
    course.save # save updated course
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "courses" SET "image" = ? WHERE "courses"."id" = ?  [["image", "https://i2.wp.com/photos.smugmug.com/photos/i-N5XkmZs/0/80690e3f/L/i-N5XkmZs-L.jpg"], ["id", 11]]

  def destroy
  course = Course.find params[:id] # get the id to delete/destroy
  course.destroy # destroy the course
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 10]]