Bastien Durand/week_05/library/library/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @book = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @book = Book.find params[:id]

INSERT INTO "books" ("name", "author", "year", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    book = Book.create book_params

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @book = Book.find params[:id]

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "Jawss"], ["updated_at", "2020-10-14 09:02:12.486151"], ["id", 3]]
---
  def update
    book = Book.find params[:id]
    book.update book_params

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
---
  def destroy
    book = Book.find params[:id]
    book.destroy