Hugo Cullinan/week05/bookfun/app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @author = Author.find params[:id]

INSERT INTO "authors" ("name", "nationality", "genre", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "qwerqwer"], ["nationality", ""], ["genre", ""], ["image", ""], ["created_at", "2020-10-14 11:07:58.244271"], ["updated_at", "2020-10-14 11:07:58.244271"]]
---
  def create
    author = Author.create author_params

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @author = Author.find params[:id]

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "authors" SET "nationality" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["nationality", "Americana"], ["updated_at", "2020-10-14 11:17:33.504576"], ["id", 1]]
---
  def update
    author = Author.find params[:id]
    author.update author_params

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 8]]
---
  def destroy
    author = Author.find params[:id]
    author.destroy