Hugo Cullinan/week05/bookfun/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.find params[:id]

INSERT INTO "books" ("title", "author", "genre", "year", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    book = Book.create book_params

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book = Book.find params[:id]

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "author" = ?, "image" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "The Great Gatsby"], ["author", "F. Scott Fitzgerald"], ["image", "https://m.media-amazon.com/images/I/41iers+HLSL.jpg"], ["updated_at", "2020-10-14 22:35:22.015937"], ["id", 3]]
---
  def update
    book = Book.find params[:id]
    book.update book_params

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 7]]
---
  def destroy
    book = Book.destroy params[:id]