Nicholas Mather/week05/music_app/app/controllers/albums_controller.rb

  def show
    @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    album = Album.create album_params
---
INSERT INTO "albums" ("title", "tracks", "cover") VALUES (?, ?, ?)  [["title", "lol"], ["tracks", ""], ["cover", "https://i.pinimg.com/originals/b4/75/00/b4750046d94fed05d00dd849aa5f0ab7.jpg"]]

  def edit
    @album = Album.find params[:id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    album = Album.find params[:id]
    album.update album_params
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "albums" SET "cover" = ? WHERE "albums"."id" = ?  [["cover", "https://f4.bcbits.com/img/a2603313414_10.jpg"], ["id", 2]]

  def destroy
    album = Album.find params[:id]
    album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 7]]