Nicholas Mather/week05/music_app/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "nationality", "members", "genre", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "beans"], ["nationality", ""], ["members", ""], ["genre", ""], ["image", ""], ["created_at", "2020-10-14 21:10:08.790842"], ["updated_at", "2020-10-14 21:10:08.790842"]]
---
  def create
    artist = Artist.create artist_params

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "artists" SET "nationality" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["nationality", "yep"], ["updated_at", "2020-10-14 21:14:13.768596"], ["id", 13]]
---
  def update
    artist = Artist.find params[:id]
    artist.update artist_params