William Rudder/week5/authbooks/app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @author = Author.find params[:id]

INSERT INTO "authors" ("name", "nationality", "dob", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    author = Author.create author_params

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
     @author = Author.find params[:id]

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "authors" SET "name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "J. K. Rowling 2"], ["updated_at", "2020-10-14 10:05:40.765937"], ["id", 2]]
---
  def update
    author = Author.find params[:id]
    author.update author_params

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 4]]
---
  def destroy
    author = Author.find params[:id]
    author.destroy