William Rudder/week5/authbooks/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @book = Book.find params[:id]

INSERT INTO "books" ("title", "author", "releasedate", "image") VALUES (?, ?, ?, ?)
---
  def create
    book = Book.create book_params