Giti Mafakheri/week-5/musicianAlbum/app/views/works/_form.html.erb

SELECT "musicians"."name", "musicians"."id" FROM "musicians"
---
  <%= f.label :musician_id %>
  <%= f.select :musician_id, Musician.pluck(:name, :id), :include_blank => true %>