Giti Mafakheri/week-5/musicianAlbum/app/views/works/show.html.erb

SELECT  "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---

  <% if @work.musician.present? %>