Farid Masjedi/week04/Movies_associations/app/views/directors/show.html.erb

  <div id="all">
    <% @director.movies.shuffle.each do |movie| %>
---
SELECT "movies".* FROM "movies" WHERE "movies"."director_id" = ?  [["director_id", 1]]